In [1]:
import pandas as pd
df_s=pd.read_excel(r"C:\Jayasri\class 13\sm.xlsx")
df_s

  friend names      quality
0     bharathi         nice
1        chamu  intellugent
2      rajitha    spritcual
3       pavani       active
4     kiranmai     innocent
5        divya       active

In [1]:
import pandas as pd
df_c=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\cm.xlsx")
df_c

  friend names    quality
0      lakshmi   innocent
1       durga       good
2     poornima      good
3    manjusha   very good
4      mounika   innocent
5         hema      good
6        divya     active

In [4]:
df_s.columns

Index(['friend names', 'quality'], dtype='object')

In [5]:
df_c.columns

Index(['friend names', 'quality'], dtype='object')

In [7]:
df_s.groupby("quality")["friend names"].count()

quality
active         2
innocent       1
intellugent    1
nice           1
spritcual      1
Name: friend names, dtype: int64

In [3]:
df_c.groupby("quality")["friend names"].count()

quality
active       1
good         3
innocent     2
very good    1
Name: friend names, dtype: int64

In [ ]:
Q2>Create and import file
1. Create boys Boysfriend_names.xls file and import file in spyder (atleast 10 names, columns are FriendName,Quality)  
2. Summarize data by quality wise no.of friends .
3. Create girls Girlsfriend_names.xls file  and import file in spyder (atleast 10 names, columns are FriendName,Quality) 
4. Summarize data by quality wise no.of friends .

In [7]:
df={"friend name":["ravi","raju","kiran","prasad"],"Quality":["Good","intelligent","good","intelligent"]}

In [8]:
df

{'friend name': ['ravi', 'raju', 'kiran', 'prasad'],
 'Quality': ['Good', 'intelligent', 'good', 'intelligent']}

In [9]:
import pandas as pd
pd.DataFrame(df)

  friend name      Quality
0        ravi         Good
1        raju  intelligent
2       kiran         good
3      prasad  intelligent

In [10]:
df.groupby("Quality")["friend name"].count()

AttributeError: 'dict' object has no attribute 'groupby'

In [9]:
import pandas as pd
df_b=pd.read_excel(r"C:\Jayasri\class 13\bf names.xlsx")
df_b

  bf names    quality
0    khaza      angry
1    anvar     active
2      sai   innocent
3     ramu  spritcual
4     ravi      angry
5     raju     active
6    delip     silent
7     devi        bad
8     vara     silent

In [10]:
df_g=pd.read_excel(r"C:\Jayasri\class 13\gf names.xlsx")
df_g

  friend names    quality
0       anusha   innocent
1      supraja  spritcual
2      jayasri     silent
3        mouni     decent
4      shabana  spritcual
5        durga   innocent
6       geetha     active
7        divya   innocent
8      lakshmi     decent
9         devi     active

In [12]:
df_g.columns

Index(['friend names', 'quality'], dtype='object')

In [13]:
df_b.columns

Index(['bf names', 'quality'], dtype='object')

In [16]:
df_b.groupby("quality")["bf names"].count()

quality
active       2
angry        2
bad          1
innocent     1
silent       2
spritcual    1
Name: bf names, dtype: int64

In [17]:
df_g.groupby("quality")["friend names"].count()

quality
active       2
decent       2
innocent     3
silent       1
spritcual    2
Name: friend names, dtype: int64

In [ ]:

Q3>Create and import file
1. Create a father side fatherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
2. Summarize data by relation wise no.of familymembers .
3. Create a mother side montherfamily_members.xls file and import file in spyder  (atleast 5 names, columns are FamilyMemberName*Relation)
4. Summarize data by relation wise no.of familymembers .

In [18]:
import pandas as pd
df_f=pd.read_excel(r"C:\Jayasri\class 13\ffm.xlsx")
df_f

  family member name      Relation
0              bujji         attha
1       nageswaramma         aunty
2              yacob         uncle
3              phani  brotherinlaw
4            likitha          akka
5             anusha          akka
6             kumari         anuty
7        anjaneyalu          uncle
8             kumar          uncle

In [19]:
df_m=pd.read_excel(r"C:\Jayasri\class 13\mfm.xlsx")
df_m

  family member name      Relation
0            bhavani         pinni
1             ramana          amma
2         rajasekhar       brother
3          rangamma   sisterin law
4              bhanu  sisterin law
5              mouni  sisterin law
6             prasad       brother

In [20]:
df_f.columns

Index(['family member name', 'Relation'], dtype='object')

In [21]:
df_m.columns

Index(['family member name', 'Relation'], dtype='object')

In [22]:
#2. Summarize data by relation wise no.of familymembers .
df_f.groupby("Relation")["family member name"].count()

Relation
akka            2
anuty           1
attha           1
aunty           1
brotherinlaw    1
uncle           3
Name: family member name, dtype: int64

In [23]:
#4. Summarize data by relation wise no.of familymembers .
df_m.groupby("Relation")["family member name"].count()

Relation
amma            1
brother         2
pinni           1
sisterin law    3
Name: family member name, dtype: int64

In [ ]:
Q4>Create and import file
1. Create a Dal related  dal_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a vegitable related  vegitable_items.xlsx file and import file in spyder (atleast 5 names, columns are VegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.

In [54]:
import pandas as pd
df_d=pd.read_excel(r"C:\Jayasri\class 13\dal_veg\dal items.xlsx")
df_d

  no_of_food_items      Taste
0       dal tomato      super
1     dal cucomber       nice
2      dal berakay    average
3  dal bitterguard       good
4       dal mangao      super
5        dal lemon      yammi
6         dal rice  very nice

In [55]:
df_v=pd.read_excel(r"C:\Jayasri\class 13\dal_veg\veg food.xlsx")
df_v

   no_of_food_items  Taste
0           potato     fry
1     ladies finger   soup
2          brinjal   curry
3            carrot    fry
4           onions   curry
5            tomato   soup
6            sambar   soup
7           cabage   curry
8       califlower   curry
9    bitter guared     fry
10             dhal   good

In [56]:
df_d.columns

Index(['no_of_food_items', 'Taste'], dtype='object')

In [57]:
df_v.columns

Index(['no_of_food_items', 'Taste'], dtype='object')

In [58]:
#2. Summarize data by taste wise no.of fooditems.
df_d.groupby("Taste")["no_of_food_items"].count()

Taste
average      1
good         1
nice         1
super        2
very nice    1
yammi        1
Name: no_of_food_items, dtype: int64

In [59]:
df_v.groupby("Taste")["no_of_food_items"].count()

Taste
curry    4
fry      3
good     1
soup     3
Name: no_of_food_items, dtype: int64

In [ ]:

Q5>Create and import file
1. Create a soups related  soups_items.xlsx file and import file in spyder (atleast 5 names, columns are soups*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a fry related  fry_items.xlsx file and import file in spyder (atleast 5 names, columns are fry*Taste)
4. Summarize data by taste wise no.of fooditems.

In [50]:
import pandas as pd
df_s=pd.read_excel(r"C:\Jayasri\class 13\soup.xlsx")
df_s

      no_of_food_items           taste
0               tomato           super
1              chicken            good
2               mutton           yammi
3  sweet corn chicken             nice
4                 rice       very nice
5                boans       excellent
6                 crap  very excellent

In [51]:
df_f=pd.read_excel(r"C:\Jayasri\class 13\fry.xlsx")
df_f

  no_of_food_items           taste
0         cucomber  good excellent
1           potato            nice
2           carrot           super
3        beat root            nice
4              egg           good
5            beans       very good
6    ladies finger            good
7          brinjal            nice
8        frons fry            good

In [45]:
df_s.columns

Index(['no_of_food_items', 'taste'], dtype='object')

In [46]:
df_f.columns

Index(['no_of_food_items', 'taste'], dtype='object')

In [52]:
#2. Summarize data by taste wise no.of fooditems.
df_s.groupby("taste")["no_of_food_items"].count()

taste
excellent         1
good              1
nice              1
super             1
very excellent    1
very nice         1
yammi             1
Name: no_of_food_items, dtype: int64

In [53]:
df_f.groupby("taste")["no_of_food_items"].count()

taste
good              2
good              1
good excellent    1
nice              3
super             1
very good         1
Name: no_of_food_items, dtype: int64

In [ ]:

Q6>Create and import file
1. Create a Chicken related chicken_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
2. Summarize data by taste wise no.of fooditems.
3. Create a mutton related mutton_items.xlsx file and import file in spyder (atleast 5 names, columns are NonVegFoodName*Taste)
4. Summarize data by taste wise no.of fooditems.

In [5]:
import pandas as pd
df_ch=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\chicken.xlsx")
df_ch

   non veg food name      taste
0            chicken       nice
1    chicken briyani      good
2      chicken curry  excellent
3        chicken fry  very good
4  sweetcorn chicken       nice
5       chicken soup      good

In [10]:
import pandas as pd
df_m=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\mutton.xlsx")
df_m

  Non_veg_foodname      taste
0     mutton curry       good
1       mutton fry       nice
2      mutton soup  very good
3   mutton charuva  excellent
4  mutton cucomber       good

In [14]:
df_m.columns

Index(['Non_veg_foodname', ' taste'], dtype='object')

In [6]:
df_ch.groupby("taste")["non veg food name"].count()

taste
excellent    1
good         2
nice         2
very good    1
Name: non veg food name, dtype: int64

In [15]:
df_m.groupby(" taste")["Non_veg_foodname"].count()

 taste
excellent    1
good         2
nice         1
very good    1
Name: Non_veg_foodname, dtype: int64

In [ ]:


Q7>Create and import file
1. Create a winter season  winterseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
2. Summarize data by Season wise no.of months.
3. Create a summer season  summerseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
4. Summarize data by Season wise no.of months.
5. Create a rainy season  rainyseason_names.xlsx file and import file in spyder  (atleast 2 names, columns are MonthName*Season)
6. Summarize data by Season wise no.of months.

In [36]:
import pandas as pd
df_w=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\month names\winter.xlsx")
df_w

  Month_Name   Season
0     january  winter
1    february  winter
2    november  winter
3    december  winter

In [38]:
df_s=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\month names\summer.xlsx")
df_s

  Month_Name   Season
0       march  summer
1       april  summer
2         may  summer

In [40]:
df_r=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\month names\rainey.xlsx")
df_r

  Month_Name          Season
0        june  rainey season
1        july  rainey season
2      august  rainey season
3   september  rainey season
4    octomber  rainey season

In [41]:
df_r.columns

Index(['Month_Name ', 'Season'], dtype='object')

In [42]:
df_s.columns

Index(['Month_Name ', 'Season'], dtype='object')

In [43]:
#2. Summarize data by Season wise no.of months.
df_s.groupby("Season")["Month_Name "].count()

Season
summer    3
Name: Month_Name , dtype: int64

In [45]:
df_w.columns

Index(['Month_Name ', 'Season'], dtype='object')

In [47]:
df_w.groupby("Season")["Month_Name "].count()

Season
winter    4
Name: Month_Name , dtype: int64

In [49]:
df_r.columns

Index(['Month_Name ', 'Season'], dtype='object')

In [50]:
df_r.groupby("Season")["Month_Name "].count()

Season
rainey season    5
Name: Month_Name , dtype: int64

In [ ]:


Q8>Create and import file
1. Create a red colour flowers redflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
2. Summarize data by color wise no.of flowers.
3. Create a white colour flowers whiteflowers_names.xlsx file  and import file in spyder  (atleast 3 names, columns are FlowerName*color)
4. Summarize data by color wise no.of flowers.
5. Create a pink colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
6. Summarize data by color wise no.of flowers.
7. Create a yellow colour flowers whiteflowers_names.xlsx file and import file in spyder   (atleast 3 names, columns are FlowerName*color)
8. Summarize data by color wise no.of flowers.

In [51]:
import pandas as pd
df_r=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\flowers\red flowers.xlsx")
df_r

       flower name colour
0         red rose    red
1     red hibiscus    red
2       red  tulip    red
3   red Crossandra    red
4              NaN    red

In [52]:
df_w=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\flowers\white flowers.xlsx")
df_w

     flower names colour
0      white rose  white
1  white hibiscus  white
2         jasmine  white
3          daisey  white
4       snow drop  white
5           lilly  white
6             NaN  white

In [64]:
df_p=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\flowers\pink flowers.xlsx")
df_p

    flower names pink colour flowers
0      pink rose                pink
1     pink tulip                pink
2    pink  lotus                pink
3  pink hibiscus                pink

In [54]:
df_y=pd.read_excel(r"C:\jaya sri\Jayasri\class 13\flowers\yellow flowers.xlsx")
df_y

  flower names  colour
0    sunflower  yellow
1     marygold  yellow
2    calendula  yellow
3   crossandra  yellow
4  tuscan gold  yellow

In [55]:
df_r.columns

Index(['flower name', 'colour'], dtype='object')

In [60]:
#2. Summarize data by color wise no.of flowers.
df_r.groupby("colour")["flower name"].count()

colour
red    4
Name: flower name, dtype: int64

In [56]:
df_w.columns

Index(['flower names', 'colour'], dtype='object')

In [61]:
#2. Summarize data by color wise no.of flowers.
df_w.groupby("colour")["flower names"].count()

colour
white    6
Name: flower names, dtype: int64

In [65]:
df_p.columns

Index(['flower names', 'pink colour flowers'], dtype='object')

In [69]:
#2. Summarize data by color wise no.of flowers.
df_p.groupby("pink colour flowers")["flower names"].count()

pink colour flowers
pink    4
Name: flower names, dtype: int64

In [58]:
df_y.columns

Index(['flower names', 'colour'], dtype='object')

In [63]:
#2. Summarize data by color wise no.of flowers.
df_y.groupby("colour")["flower names"].count()

colour
yellow    5
Name: flower names, dtype: int64